Program primer;
var
  n: integer; //не удалять!!! нужна для работы меню
  // раздел для объявления переменных. 
Begin
        // не УДАЛЯТЬ!! Организовано меню
     writeln ('введите номер задачи');
     Readln(n);
case n of

//вычисление функции вариант 1
1:
  Begin 
    // сюда пишем код программы варианта
  end;

//вычисление функции вариант 2
2:
  Begin 
    // сюда пишем код программы варианта
  end;
  //вычисление функции вариант 3
3:
  Begin 
    // сюда пишем код программы варианта
  end;
  //вычисление функции вариант 4
4:
  Begin 
    // сюда пишем код программы варианта
  end;
  //вычисление функции вариант 5
5:
  Begin 
    // сюда пишем код программы варианта
  end;
//вычисление функции вариант 1
6:
  Begin 
    // сюда пишем код программы варианта
  end;
  end;
  end.